Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Use the settings on the StealthChop tab to further parametrize the StealthChop chopper scheme.
it_it: Utilizzare le impostazioni nel tab StealthChop per parametrizzare ulteriormente lo schema del chopper StealthChop.

source: Use the slider to set the StallGuard threshold value.
it_it: Utilizzare il cursore per impostare il valore di soglia dello StallGuard.

source: Use the up and down arrow buttons for changing the order of the mapped objects in the list.
it_it: Utilizzare i pulsanti freccia su e giù per modificare l'ordine degli oggetti mappati nell'elenco.

source: Use the up and down arrow buttons to move an assigned module up and down on the list of assigned modules.
it_it: Utilizzare i pulsanti freccia su e giù per spostare un modulo assegnato verso l'alto e verso il basso nell'elenco dei moduli assegnati.

source: Use the RS485.begin function to initialize serial port Serial1, set the baud rate, data format, and specify the receive and transmit pins.
it_it: Utilizzare la funzione RS485.begin per inizializzare la porta seriale Serial1, impostare la velocità in baud, il formato dei dati e specificare i pin di ricezione e trasmissione.

source: Use the UART.begin function to initialize serial port Serial , set the baud rate, data format, and specify the receive and transmit pins.
it_it: Utilizzare la funzione UART.begin per inizializzare la porta seriale Serial, impostare la velocità in baud, il formato dei dati e specificare i pin di ricezione e trasmissione.

source: Use this function for a step-by-step execution of the TMCL program.
it_it: Utilizzare questa funzione per un'esecuzione passo-passo del programma TMCL.

source: Use this function with care, as all changes made in the PDO Configurator which have not yet been sent to the device will be lost by reloading the PDO definitions from the device.
it_it: Utilizzare questa funzione con cautela, poiché tutte le modifiche apportate nel PDO Configurator che non sono ancora state inviate al dispositivo andranno perse ricaricando le definizioni PDO dal dispositivo.

source: Use this tool as follows:
it_it: Utilizzare questo strumento come segue:

source: Use with care as this can lead to the fact that one device uses a different bitrate than the other devices.
it_it: Utilizzalo con cautela poiché questo potrebbe far sì che un dispositivo utilizzi un bitrate diverso dagli altri.

source: Using Install Online is relatively simple and can be installed with just one click.
it_it: Utilizzare Install Online è relativamente semplice e l'installazione può essere eseguita con un solo clic.

source: Using CAN it is also possible to connect more than one module to the same bus.
it_it: Utilizzando CAN è anche possibile collegare più moduli allo stesso bus.

source: Using DCF Files
it_it: Utilizzo dei File DCF

source: Using RS485 it is also possible to connect more than one module to one port.
it_it: Utilizzando RS485 è anche possibile collegare più moduli a una porta.

source: Using the Disconnect button it is possible to temporarily close the USB connection to the module, so that other PC software can connect to the module without having to close the TMCL-IDE itself.
it_it: Utilizzando il pulsante Disconnect è possibile chiudere temporaneamente la connessione USB al modulo, in modo che altri software per PC possano connettersi al modulo senza dover chiudere TMCL-IDE.

source: Using the Import button an INI file can be read back and the values can be send to the registers.
it_it: Utilizzando il pulsante Import è possibile leggere un file INI e inviare i valori ai registri.

source: Using the Inspect & Change section, the contents of local TMCL/PC variables can be inspected and also changed.
it_it: Utilizzando la sezione Inspect & Change, è possibile ispezionare e modificare il contenuto delle variabili locali TMCL/PC.

source: Using the Stop and the Start button the continuous polling of CANopen objects can be stopped and started.
it_it: Utilizzando i pulsanti Stop e Start, è possibile interrompere e avviare l'interrogazione continua degli oggetti CANopen.

source: Using the Watches section the contents of selectable local variable can also be displayed.
it_it: Utilizzando la sezione Watches è possibile visualizzare anche il contenuto delle variabili locali selezionabili.

source: Using the Device Configuration tool, DCF files (according to the CiA-305 standard) can be generated, and DCF files can be used to configure devices.
it_it: Utilizzando il tool Device Configuration, è possibile generare file DCF (secondo lo standard CiA-305) e utilizzarli per configurare i dispositivi.

source: Using the Global Parameters tool, the global parameters of a module can be set.
it_it: Utilizzando lo strumento "Global Parameters", è possibile impostare i parametri globali di un modulo.

source: Using the PDO Transmitter tool, PDOs can be sent to each connected device in an easy and convenient way.
it_it: Utilizzando lo strumento PDO Transmitter, è possibile inviare i PDO a ciascun dispositivo connesso in modo semplice e pratico.

source: Using the TMCL Creator it is possible to develop stand-alone TMCL programs.
it_it: Utilizzando il TMCL Creator è possibile sviluppare programmi TMCL "stand-alone".

source: Using the shortcut F1, enter esp-idf:show examples projects
it_it: Utilizzando la scorciatoia F1, immettere esp-idf:show examples projects

source: Using these, handling modules that use the CANopen protocol will be nearly as easy as using TMCL.
it_it: Utilizzandoli, la gestione dei moduli che utilizzano il protocollo CANopen sarà quasi semplice quanto quella di TMCL.

source: Using this function the auto start mode of a module can be switched on or off.
it_it: Utilizzando questa funzione è possibile attivare o disattivare la modalità di avvio automatico di un modulo.

source: Using this tool, the parameter save/restore functions of a device can be used easily, without having to remember the CANopen save and load signatures.
it_it: Utilizzando questo strumento, le funzioni di salvataggio/ripristino dei parametri di un dispositivo possono essere utilizzate facilmente, senza dover ricordare le firme di salvataggio e caricamento CANopen.

source: Utilities
it_it: Utilità

source: VCC_IO : The pin is connected to VCC_IO and thus pulled high.
it_it: VCC_IO : Il pin è collegato a VCC_IO e quindi è alto.

source: VScode official website
it_it: Sito web ufficiale di VScode

source: Values above 64 recommended with most modules.
it_it: i consigliano valori superiori a 64 con la maggior parte dei moduli.

source: Values being displayed in most tools will not be updated any more then.
it_it: I valori visualizzati nella maggior parte degli strumenti non verranno più aggiornati.

source: Values being displayed in most tools will not be updated anymore then.
it_it: I valori visualizzati nella maggior parte degli strumenti non verranno più aggiornati.

source: Values displayed in the tools will then be updated again.
it_it: I valori visualizzati negli strumenti verranno quindi aggiornati nuovamente.

source: Velocities shown using red color should not be chosen.
it_it: Non si dovrebbero scegliere le velocità indicate in rosso.

source: Velocities shown using yellow color can also be used, but with care as they might cause problems (maybe the motor will stop even when not being stalled).
it_it: È possibile utilizzare anche le velocità indicate in giallo, ma con cautela poiché potrebbero causare problemi (il motore potrebbe arrestarsi anche se non è in stallo).

source: Velocity tuning
it_it: Regolazione della velocità

source: Version
it_it: Versione

source: Version number requirement
it_it: Numero di versione richiesto

source: Vertical synchronization signal
it_it: Segnale di sincronizzazione verticale

source: Very old TRINAMIC modules (most of them (except for the TMCM-110) are not supported by the TMCL-IDE 3.x and 4.x) use a different boot loader protocol.
it_it: I moduli TRINAMIC molto vecchi (la maggior parte dei quali, ad eccezione del TMCM-110, non è supportata da TMCL-IDE 3.x e 4.x) utilizzano un protocollo di bootloader diverso.

source: View the system information:
it_it: Visualizzare le informazioni di sistema:

source: Viewing angle
it_it: Angolo di visione

source: Views: Hide or show the other windows around the central view.
it_it: Views: Nasconde o mostra le altre finestre attorno alla vista centrale.

source: Violations of parameter ranges will lead to an error message.
it_it: Le violazioni degli intervalli parametri genereranno un messaggio di errore.

source: Visible strings can be entered as text, and octet strings can be entered as hexadecimal bytes (two digits without preceding “0x”) separated by spaces.
it_it: Le stringhe visibili possono essere inserite come testo e quelle di ottetti come byte esadecimali (due cifre senza "0x" come precetto) separate da spazi.

source: W: parameter is writable
it_it: W: il parametro è scrivibile

source: WDRV <register>, <upper>, <value>, <module index>: write to a motor driver register.
it_it: WDRV <register>, <upper>, <value>, <module index>: scrittura su un registro del driver motore.

source: WDRVA <type>, <register>, <module index>: copy contents of the accumulator to a motor driver register.
it_it: WDRVA <type>, <register>, <module index>: copia il contenuto dell'accumulatore in un registro del driver del motore.

source: WMC <register>, <upper>, <value>, <module index>: write to a motion controller register.
it_it: WMC <register>, <upper>, <value>, <module index>: scrittura su un registro del controller di movimento.

source: WMCA <register>, <upper>, <module index>: copy contents of the accumulator to a motion controller register.
it_it: WMCA <register>, <upper>, <module index>: copia il contenuto dell'accumulatore in un registro del controller di movimento.

source: Wait for download
it_it: Attendere il download

source: What if the Update Process has been aborted?
it_it: Cosa succede se il processo di aggiornamento è stato interrotto?

source: When a breakpoint is set a red bullet with a green tick will be displayed in that line.
it_it: Quando un breakpoint è impostato, nella riga corrispondente verrà visualizzato un punto rosso con un segno di spunta verde.

source: When a data alert is triggered, the loop receives messages and calls the handle_rx_message function to process them.
it_it: Quando viene attivato un avviso sui dati, il ciclo riceve i messaggi e richiama la funzione handle_rx_message per elaborarli.

source: When a program is running (started by the Run/Continue or by the Animate function), the program execution can be interrupted at any time by selecting the Pause function from the Debug menu or by clicking the Pause icon on the tool bar or by pressing F2.
it_it: Quando un programma è in esecuzione (avviato dalla funzione Run/Continue o dalla funzione Animate l'esecuzione del programma può essere interrotta in qualsiasi momento selezionando la funzione Pause dal menù Debug oppure cliccando sull'icona Pause sulla barra degli strumenti o premendo F2.

source: When accessing an object via SDO communication the module has to answer within this time.
it_it: Quando si accede a un oggetto tramite comunicazione SDO, il modulo deve rispondere entro questo intervallo di tempo.

source: When an evaluation board (Landungsbruecke or Startrampe in conjunction with one or two chip evaluation boards) is connected, some special evaluation board tools will appear in the tree view.
it_it: Quando si collega una scheda di valutazione (Landungsbruecke o Startrampe in combinazione con una o due evaluation board del chip), nella vista ad albero appariranno alcuni strumenti speciali per la scheda di valutazione.

source: When auto start mode is switched on the TMCL program stored in the module will be executed automatically each time the supply power for the module is switched on.
it_it: Quando la modalità di avvio automatico è attiva, il programma TMCL memorizzato nel modulo verrà eseguito automaticamente ogni volta che il modulo viene alimentato.

source: When changing a physical value the Parameter Calculator normally tries to find the best combination of pulse divisor and/or ramp divisor and velocity and/or acceleration to achieve this value.
it_it: Quando si modifica un valore fisico, il "Parameter Calculator" normalmente cerca di trovare la migliore combinazione tra divisore di impulsi e/o divisore di rampa e velocità e/o accelerazione per ottenere tale valore.

source: When generating a DCF file, all these last written values will also be written to the DCF file.
it_it: Quando si genera un file DCF, tutti gli ultimi valori scritti verranno scritti anche nel file DCF.

source: When installing Arduino libraries, there are usually two ways to choose from: Install online and Install offline. If the library installation requires offline installation, you must use the provided library file
it_it: Quando si installano le librerie Arduino, di solito ci sono due modi tra cui scegliere: Installazione online e Installazione offline. Se l'installazione della libreria richiede l'installazione offline, è necessario utilizzare il file di libreria fornito.

source: When it is enabled the algorithm will work as described above.
it_it: Quando è abilitata, l'algoritmo funzionerà come descritto sopra.

source: When many devices are connected or with devices that respond slower, a higher value will be needed.
it_it: Quando sono collegati molti dispositivi o con dispositivi che rispondono più lentamente, sarà necessario un valore più alto.

source: When not set, the assembler dialog will be closed automatically on success.
it_it: Se non impostato, la finestra di dialogo dell'assembler verrà chiusa automaticamente in caso di esito positivo.

source: When not set, the disassembler dialog will be closed automatically on success.
it_it: Se non impostata, la finestra di dialogo del disassemblatore verrà chiusa automaticamente in caso di successo.

source: When not set, the download dialog will be closed automatically on success.
it_it: Se non impostata, la finestra di dialogo del download verrà chiusa automaticamente in caso di successo.

source: When only a few devices are connected that have a short response time also lower values can be used.
it_it: Quando sono collegati solo pochi dispositivi con un tempo di risposta breve, è possibile utilizzare anche valori più bassi.

source: When only the TMCL-IDE is used then this can be switched off, so that also TMCL modules with a different reply ID can be found.
it_it: Quando si utilizza solo TMCL-IDE, questa opzione può essere disattivata, in modo da poter trovare anche i moduli TMCL con un ID di risposta diverso.

source: When opened for the first time, the PDO Configurator tool reads all RPDO definitions and all TPDO definitions from the device.
it_it: Alla prima apertura, il PDO Configurator legge tutte le definizioni RPDO e TPDO dal dispositivo.

source: When opened for the first time, the PDO Receiver tool reads out all TPDO definitions from the device in order to be able to display the PDO contents correctly.
it_it: Al primo avvio, il tool PDO Receiver legge tutte le definizioni TPDO dal dispositivo per poter visualizzare correttamente il contenuto dei PDO.

source: When opened for the first time, the PDO Transmitter tool reads out all RPDO definitions from the device.
it_it: Al primo avvio, il tool PDO Transmitter legge tutte le definizioni RPDO dal dispositivo.

source: When reading from a 64 bit register two RDRV commands are needed.
it_it: Quando si legge da un registro a 64 bit, sono necessari due comandi RDRV.

source: When reading from a 64 bit register two RMC commands are needed.
it_it: Quando si legge da un registro a 64 bit, sono necessari due comandi RMC.

source: When reading from an object the tool will try to automatically recognize the object type (even if there is an EDS file this tool will not use the information from it).
it_it: Quando si legge da un oggetto, il tool tenterà di riconoscerne automaticamente il tipo (anche se è presente un file EDS, lo strumento non utilizzerà le informazioni in esso contenute).

source: When releasing the button the motor will be stopped.
it_it: Rilasciando il pulsante, il motore si arresta.

source: When searching for modules, the reply ID will be excluded from the scan.
it_it: Durante la ricerca dei moduli, l'ID di risposta verrà escluso dalla scansione.

source: When switched on (default setting), all CAN messages sent and received on this CAN port will be shown in the Log window.
it_it: Se attivata (il default), tutti i messaggi CAN inviati e ricevuti su questa porta CAN verranno visualizzati nella finestra di Log.

source: When the Start button is pressed, the P parameter is increased until the actual position is as close to the target position as possible.
it_it: Quando si preme il pulsante Start, il parametro P viene aumentato fino a quando la posizione effettiva non si avvicina il più possibile alla posizione target.

source: When the Cyclic Polling checkbox is checked the actual position display will be updated on a regular base, by polling the actual position object via SDO.
it_it: Quando la checkbox Cyclic Polling è selezionata, la visualizzazione della posizione effettiva verrà aggiornata regolarmente, interrogando l'oggetto di posizione effettiva tramite SDO.

source: When the Cyclic Polling checkbox is checked the actual velocity display will be updated on a regular base, by polling the actual velocity object via SDO.
it_it: Quando la checkbox Cyclic Polling è selezionata, la visualizzazione della velocità effettiva verrà aggiornata regolarmente, interrogando l'actual velocity object tramite SDO.

source: When the Cyclic Polling checkbox is checked the status word display will be updated on a regular base, by polling the status word object via SDO.
it_it: Quando la checkbox Cyclic Polling è selezionata, la visualizzazione della parola di stato verrà aggiornata regolarmente, interrogando la word di stato dell'oggetto tramite SDO.

source: When the Cyclic polling checkbox is checked the current state display will be updated on a regular base, by polling the status word via SDO.
it_it: Quando la checkbox Cyclic polling è selezionata, la visualizzazione dello stato attuale verrà aggiornata regolarmente, interrogando la word di stato tramite SDO.

source: When the Clear write value option is checked the input fields will always be reset to zero when a new object has been selected.
it_it: Quando l'opzione Clear write value è selezionata, i campi di input verranno sempre azzerati quando viene selezionato un nuovo oggetto.

source: When the data type VISIBLE STRING or OCTET STRING is selected, only the right display field and the right input field will be used.
it_it: Quando si seleziona il tipo di dati VISIBLE STRING o OCTET STRING, verranno utilizzati solo il campo di visualizzazione e quello di input corretti.

source: When the frequency is too high and the computer freezes, it may cause bus errors
it_it: Quando la frequenza è troppo alta e il computer si blocca, potrebbero verificarsi errori del bus.

source: When the project uses a specific version, it can be switched to by utilizing it
it_it: Quando il progetto utilizza una versione specifica, è possibile passare a questa utilizzandola

source: When the required components and demos are imported into the CMakeLists.txt, the compilation tool CMake will import each content that needs to be compiled according to the index.
it_it: Quando i componenti e le demo richiesti vengono importati in CMakeLists.txt, lo strumento di compilazione CMake importerà ogni contenuto che deve essere compilato in base all'indice.

source: When this checkbox is checked, SDO messages generated for tracing/polling CANopen objects will not be shown in the log window.
it_it: Se questa checkbox è selezionata, i messaggi SDO generati per il tracciamento/polling di oggetti CANopen non verranno visualizzati nella finestra di registro.

source: When using CAN in bootloader mode, the bit rate is always 1000kBit/s, the module CAN ID is always 1 and the reply ID is always 2.
it_it: Quando si utilizza CAN in modalità bootloader, il bit rate è sempre 1000 kBit/s, l'ID CAN del modulo è sempre 1 e l'ID di risposta è sempre 2.

source: When using RS232 or RS485 you will have to switch the baudrate in the connection window to 115200 before clicking the Connect button, as in bootloader mode the baud rate is always 115200, the module ID is always 1 and the reply ID is always 2.
it_it: Quando si utilizza RS232 o RS485, è necessario impostare il baudrate nella finestra di connessione su 115200 prima di cliccare sul pulsante Connect, poiché in modalità bootloader il baudrate è sempre 115200, l'ID modulo è sempre 1 e l'ID di risposta è sempre 2.

source: When using RS485 it is often necessary that only the module that is to be updated is connected to the RS485 bus, so disconnect all other modules if problems should occur during firmware update.
it_it: Quando si utilizza RS485, è spesso necessario che solo il modulo da aggiornare sia collegato al bus RS485, quindi scollegare tutti gli altri moduli in caso di problemi durante l'aggiornamento del firmware.

source: When using UART, it is the same as other normal UART devices (the device number identified by the Raspberry is ttyACM*, and the new devices can be queried by plugging and unplugging devices.)
it_it: Quando si utilizza UART, è come per gli altri normali dispositivi UART (il numero di dispositivo identificato dal Raspberry è ttyACM* e i nuovi dispositivi possono essere interrogati collegandoli e scollegandoli).

source: When using the Import from DCF and save to NVM button, all values are additionally stored to the NVM of the module using object 1010h sub-index 1.
it_it: Quando si utilizza il pulsante Import from DCF and save to NVM, tutti i valori vengono inoltre memorizzati nella NVM del modulo utilizzando l'oggetto 1010h sottoindice 1.

source: When using your own UI program, there is a lack of memory, you can click Tools to select a larger partition table
it_it: Se si utilizza il proprio programma di interfaccia utente e si verifica una mancanza di memoria, è possibile cliccare su Tools per selezionare una tabella delle partizioni più grande

source: When writing to a 64 bit register, two WDRV commands are needed.
it_it: Quando si scrive su un registro a 64 bit, sono necessari due comandi WDRV.

source: When writing to a 64 bit register, two WDRVA commands are needed.
it_it: Quando si scrive su un registro a 64 bit, sono necessari due comandi WDRVA.

source: When writing to a 64 bit register, two WMC commands are needed.
it_it: Quando si scrive su un registro a 64 bit, sono necessari due comandi WMC.

source: When writing to a 64 bit register, two WMCA commands are needed.
it_it: Quando si scrive su un registro a 64 bit, sono necessari due comandi WMCA.

source: When writing values to CANopen objects using the Object Browser or the PDO Configurator, the last written value will always be written to an internal buffer.
it_it: Quando si scrivono valori su oggetti CANopen utilizzando Object Browser o PDO Configurator, l'ultimo valore scritto verrà sempre scritto in un buffer interno.

source: Whenever an object has been written, the Component of DCF File checkbox will be checked.
it_it: Ogni volta che un oggetto viene scritto, la checkbox Component of DCF File sarà selezionata.

source: Whenever an object or a sub index is selected, its content will be read and displayed on the upper left side of the window.
it_it: Ogni volta che si seleziona un oggetto o un sottoindice, il suo contenuto verrà letto e visualizzato nella parte superiore sinistra della finestra.
